cask_args appdir: '/Applications'
tap "brewsci/science"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jlhonora/lsusb"

# brew
brew "cmake"
brew "ffmpeg"
brew "git"
brew "glfw"
brew "libusb"
brew "libxml2", link: true
brew "mas"
brew "openssh"
brew "p7zip"
brew "php@7.1"
brew "pkg-config"
brew "pyenv"
brew "smartmontools"
brew "wakeonlan"
brew "wallpaper"
brew "wget"
brew "jlhonora/lsusb/lsusb"

# cask
cask "adobe-acrobat-reader"
cask "android-file-transfer"
cask "android-studio"
cask "appcleaner"
cask "arduino"
cask "chromedriver"
cask "cyberduck"
cask "firefox"
cask "github"
cask "hugin"
cask "imazing"
cask "powershell"
cask "scroll-reverser"
cask "thunderbird"
cask "unity-hub"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "xampp"

# mas
mas "Apple Configurator 2", id: 1037126344
mas "Bandwidth+", id: 490461369
mas "LINE", id: 539883307
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Remote Desktop 10", id: 1295203466
mas "Xcode", id: 497799835

## mas kakin
mas "1Password 7 - Password Manager", id: 1333542190
mas "DaisyDisk", id: 411643860
mas "Magnet", id: 441258766
